
import { useEffect, useState } from "react";

const Memo = ({setPopName }) => {

    return (
        <>
        <div className="Memo TopCtPop">
            <button type="button" className="subclose close16" onClick={(e) => {setPopName();}}/>
            <div className="popTit">메모</div>
            <div className="write-con memo">
                <p>
                    프란츠 리스트가 파가니니의 카프리스와프란츠 리스트가 파가니니의 카프리스와프란츠 리스트가 파가니니의 카프리스와프란츠 리스트가 파가니니의 카프리스와프란츠 리스트가 파가니니의 카프리스와프란츠 리스트가 파가니니의 카프리스와<br/>
                    바이올린 협주곡 중 일부 멜로디를 차용하여<br/>
                    피아노 에튀드로 편곡한 곡집이다.<br/>
                    프란츠 리스트가 파가니니의 카프리스와<br/>
                    바이올린 협주곡 중 일부 멜로디를 차용하여<br/>
                    피아노 에튀드로 편곡한 곡집이다.<br/>
                    프란츠 리스트가 파가니니의 카프리스와<br/>
                    바이올린 협주곡 중 일부 멜로디를 차용하여<br/>
                    피아노 에튀드로 편곡한 곡집이다.<br/>
                    프란츠 리스트가 파가니니의 카프리스와<br/>
                    바이올린 협주곡 중 일부 멜로디를 차용하여<br/>
                    피아노 에튀드로 편곡한 곡집이다.<br/>
                    프란츠 리스트가 파가니니의 카프리스와<br/>
                    바이올린 협주곡 중 일부 멜로디를 차용하여<br/>
                    피아노 에튀드로 편곡한 곡집이다.<br/>
                    프란츠 리스트가 파가니니의 카프리스와<br/>
                    바이올린 협주곡 중 일부 멜로디를 차용하여<br/>
                    피아노 에튀드로 편곡한 곡집이다.<br/>
                    프란츠 리스트가 파가니니의 카프리스와<br/>
                    바이올린 협주곡 중 일부 멜로디를 차용하여<br/>
                    피아노 에튀드로 편곡한 곡집이다.<br/>
                    프란츠 리스트가 파가니니의 카프리스와<br/>
                    바이올린 협주곡 중 일부 멜로디를 차용하여<br/>
                    피아노 에튀드로 편곡한 곡집이다.<br/>
                </p>
            </div>
        </div>
        </>
    )
}
export default Memo;
